# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
import mysql.connector
from getpass import getpass

In [11]:
# pd.set_option('display.max_columns', None)
# pd.set_option('display.max.rows', None)

In [2]:
cnx = mysql.connector.connect(user = "root",
                             password = getpass(),
                             host = "localhost",
                             database = "sakila")

········

In [3]:
cnx.is_connected()

True

In [4]:
cursor = cnx.cursor()

In [5]:
query = ("""SELECT actor_id, first_name, last_name
            FROM sakila.actor;""")

cursor.execute(query)

results = cursor.fetchall()

In [6]:
results

[(1, 'PENELOPE', 'GUINESS'),
 (2, 'NICK', 'WAHLBERG'),
 (3, 'ED', 'CHASE'),
 (4, 'JENNIFER', 'DAVIS'),
 (5, 'JOHNNY', 'LOLLOBRIGIDA'),
 (6, 'BETTE', 'NICHOLSON'),
 (7, 'GRACE', 'MOSTEL'),
 (8, 'MATTHEW', 'JOHANSSON'),
 (9, 'JOE', 'SWANK'),
 (10, 'CHRISTIAN', 'GABLE'),
 (11, 'ZERO', 'CAGE'),
 (12, 'KARL', 'BERRY'),
 (13, 'UMA', 'WOOD'),
 (14, 'VIVIEN', 'BERGEN'),
 (15, 'CUBA', 'OLIVIER'),
 (16, 'FRED', 'COSTNER'),
 (17, 'HELEN', 'VOIGHT'),
 (18, 'DAN', 'TORN'),
 (19, 'BOB', 'FAWCETT'),
 (20, 'LUCILLE', 'TRACY'),
 (21, 'KIRSTEN', 'PALTROW'),
 (22, 'ELVIS', 'MARX'),
 (23, 'SANDRA', 'KILMER'),
 (24, 'CAMERON', 'STREEP'),
 (25, 'KEVIN', 'BLOOM'),
 (26, 'RIP', 'CRAWFORD'),
 (27, 'JULIA', 'MCQUEEN'),
 (28, 'WOODY', 'HOFFMAN'),
 (29, 'ALEC', 'WAYNE'),
 (30, 'SANDRA', 'PECK'),
 (31, 'SISSY', 'SOBIESKI'),
 (32, 'TIM', 'HACKMAN'),
 (33, 'MILLA', 'PECK'),
 (34, 'AUDREY', 'OLIVIER'),
 (35, 'JUDY', 'DEAN'),
 (36, 'BURT', 'DUKAKIS'),
 (37, 'VAL', 'BOLGER'),
 (38, 'TOM', 'MCKELLEN'),
 (39, 'GOLDIE', 'BRODY'),
 (40, 'JOHNNY', 'CAGE'),
 (41, 'JODIE', 'DEGENERES'),
 (42, 'TOM', 'MIRANDA'),
 (43, 'KIRK', 'JOVOVICH'),
 (44, 'NICK', 'STALLONE'),
 (45, 'REESE', 'KILMER'),
 (46, 'PARKER', 'GOLDBERG'),
 (47, 'JULIA', 'BARRYMORE'),
 (48, 'FRANCES', 'DAY-LEWIS'),
 (49, 'ANNE', 'CRONYN'),
 (50, 'NATALIE', 'HOPKINS'),
 (51, 'GARY', 'PHOENIX'),
 (52, 'CARMEN', 'HUNT'),
 (53, 'MENA', 'TEMPLE'),
 (54, 'PENELOPE', 'PINKETT'),
 (55, 'FAY', 'KILMER'),
 (56, 'DAN', 'HARRIS'),
 (57, 'JUDE', 'CRUISE'),
 (58, 'CHRISTIAN', 'AKROYD'),
 (59, 'DUSTIN', 'TAUTOU'),
 (60, 'HENRY', 'BERRY'),
 (61, 'CHRISTIAN', 'NEESON'),
 (62, 'JAYNE', 'NEESON'),
 (63, 'CAMERON', 'WRAY'),
 (64, 'RAY', 'JOHANSSON'),
 (65, 'ANGELA', 'HUDSON'),
 (66, 'MARY', 'TANDY'),
 (67, 'JESSICA', 'BAILEY'),
 (68, 'RIP', 'WINSLET'),
 (69, 'KENNETH', 'PALTROW'),
 (70, 'MICHELLE', 'MCCONAUGHEY'),
 (71, 'ADAM', 'GRANT'),
 (72, 'SEAN', 'WILLIAMS'),
 (73, 'GARY', 'PENN'),
 (74, 'MILLA', 'KEITEL'),
 (75, 'BURT', 'POSEY'),
 (76, 'ANGELINA', 'ASTAIRE'),
 (77, 'CARY', 'MCCONAUGHEY'),
 (78, 'GROUCHO', 'SINATRA'),
 (79, 'MAE', 'HOFFMAN'),
 (80, 'RALPH', 'CRUZ'),
 (81, 'SCARLETT', 'DAMON'),
 (82, 'WOODY', 'JOLIE'),
 (83, 'BEN', 'WILLIS'),
 (84, 'JAMES', 'PITT'),
 (85, 'MINNIE', 'ZELLWEGER'),
 (86, 'GREG', 'CHAPLIN'),
 (87, 'SPENCER', 'PECK'),
 (88, 'KENNETH', 'PESCI'),
 (89, 'CHARLIZE', 'DENCH'),
 (90, 'SEAN', 'GUINESS'),
 (91, 'CHRISTOPHER', 'BERRY'),
 (92, 'KIRSTEN', 'AKROYD'),
 (93, 'ELLEN', 'PRESLEY'),
 (94, 'KENNETH', 'TORN'),
 (95, 'DARYL', 'WAHLBERG'),
 (96, 'GENE', 'WILLIS'),
 (97, 'MEG', 'HAWKE'),
 (98, 'CHRIS', 'BRIDGES'),
 (99, 'JIM', 'MOSTEL'),
 (100, 'SPENCER', 'DEPP'),
 (101, 'SUSAN', 'DAVIS'),
 (102, 'WALTER', 'TORN'),
 (103, 'MATTHEW', 'LEIGH'),
 (104, 'PENELOPE', 'CRONYN'),
 (105, 'SIDNEY', 'CROWE'),
 (106, 'GROUCHO', 'DUNST'),
 (107, 'GINA', 'DEGENERES'),
 (108, 'WARREN', 'NOLTE'),
 (109, 'SYLVESTER', 'DERN'),
 (110, 'SUSAN', 'DAVIS'),
 (111, 'CAMERON', 'ZELLWEGER'),
 (112, 'RUSSELL', 'BACALL'),
 (113, 'MORGAN', 'HOPKINS'),
 (114, 'MORGAN', 'MCDORMAND'),
 (115, 'HARRISON', 'BALE'),
 (116, 'DAN', 'STREEP'),
 (117, 'RENEE', 'TRACY'),
 (118, 'CUBA', 'ALLEN'),
 (119, 'WARREN', 'JACKMAN'),
 (120, 'PENELOPE', 'MONROE'),
 (121, 'LIZA', 'BERGMAN'),
 (122, 'SALMA', 'NOLTE'),
 (123, 'JULIANNE', 'DENCH'),
 (124, 'SCARLETT', 'BENING'),
 (125, 'ALBERT', 'NOLTE'),
 (126, 'FRANCES', 'TOMEI'),
 (127, 'KEVIN', 'GARLAND'),
 (128, 'CATE', 'MCQUEEN'),
 (129, 'DARYL', 'CRAWFORD'),
 (130, 'GRETA', 'KEITEL'),
 (131, 'JANE', 'JACKMAN'),
 (132, 'ADAM', 'HOPPER'),
 (133, 'RICHARD', 'PENN'),
 (134, 'GENE', 'HOPKINS'),
 (135, 'RITA', 'REYNOLDS'),
 (136, 'ED', 'MANSFIELD'),
 (137, 'MORGAN', 'WILLIAMS'),
 (138, 'LUCILLE', 'DEE'),
 (139, 'EWAN', 'GOODING'),
 (140, 'WHOOPI', 'HURT'),
 (141, 'CATE', 'HARRIS'),
 (142, 'JADA', 'RYDER'),
 (143, 'RIVER', 'DEAN'),
 (144, 'ANGELA', 'WITHERSPOON'),
 (145, 'KIM', 'ALLEN'),
 (146, 'ALBERT', 'JOHANSSON'),
 (147, 'FAY', 'WINSLET'),
 (148, 'EMILY', 'DEE'),
 (149, 'RUSSELL', 'TEMPLE'),
 (150, 'JAYNE', 'NOLTE'),
 (151, 'GEOFFREY', 'HESTON'),
 (152, 'BEN', 'HARRIS'),
 (153, 'MINNIE', 'KILMER'),
 (154, 'MERYL', 'GIBSON'),
 (155, 'IAN', 'TANDY'),
 (156, 'FAY', 'WOOD'),
 (157, 'GRETA', 'MALDEN'),
 (158, 'VIVIEN', 'BASINGER'),
 (159, 'LAURA', 'BRODY'),
 (160, 'CHRIS', 'DEPP'),
 (161, 'HARVEY', 'HOPE'),
 (162, 'OPRAH', 'KILMER'),
 (163, 'CHRISTOPHER', 'WEST'),
 (164, 'HUMPHREY', 'WILLIS'),
 (165, 'AL', 'GARLAND'),
 (166, 'NICK', 'DEGENERES'),
 (167, 'LAURENCE', 'BULLOCK'),
 (168, 'WILL', 'WILSON'),
 (169, 'KENNETH', 'HOFFMAN'),
 (170, 'MENA', 'HOPPER'),
 (171, 'OLYMPIA', 'PFEIFFER'),
 (172, 'GROUCHO', 'WILLIAMS'),
 (173, 'ALAN', 'DREYFUSS'),
 (174, 'MICHAEL', 'BENING'),
 (175, 'WILLIAM', 'HACKMAN'),
 (176, 'JON', 'CHASE'),
 (177, 'GENE', 'MCKELLEN'),
 (178, 'LISA', 'MONROE'),
 (179, 'ED', 'GUINESS'),
 (180, 'JEFF', 'SILVERSTONE'),
 (181, 'MATTHEW', 'CARREY'),
 (182, 'DEBBIE', 'AKROYD'),
 (183, 'RUSSELL', 'CLOSE'),
 (184, 'HUMPHREY', 'GARLAND'),
 (185, 'MICHAEL', 'BOLGER'),
 (186, 'JULIA', 'ZELLWEGER'),
 (187, 'RENEE', 'BALL'),
 (188, 'ROCK', 'DUKAKIS'),
 (189, 'CUBA', 'BIRCH'),
 (190, 'AUDREY', 'BAILEY'),
 (191, 'GREGORY', 'GOODING'),
 (192, 'JOHN', 'SUVARI'),
 (193, 'BURT', 'TEMPLE'),
 (194, 'MERYL', 'ALLEN'),
 (195, 'JAYNE', 'SILVERSTONE'),
 (196, 'BELA', 'WALKEN'),
 (197, 'REESE', 'WEST'),
 (198, 'MARY', 'KEITEL'),
 (199, 'JULIA', 'FAWCETT'),
 (200, 'THORA', 'TEMPLE')]

In [7]:
import pandas as pd

pd.DataFrame(results)

       0         1             2
0      1  PENELOPE       GUINESS
1      2      NICK      WAHLBERG
2      3        ED         CHASE
3      4  JENNIFER         DAVIS
4      5    JOHNNY  LOLLOBRIGIDA
..   ...       ...           ...
195  196      BELA        WALKEN
196  197     REESE          WEST
197  198      MARY        KEITEL
198  199     JULIA       FAWCETT
199  200     THORA        TEMPLE

[200 rows x 3 columns]

# Challenge 1 - Working with JSON files
Import the pandas library.

In [8]:
import pandas as pd
import numpy as np

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [9]:
nasa = pd.read_json("nasa.json", orient = "records")
nasa = pd.DataFrame(nasa)

Now that we have loaded the data, let's examine it using the head() function.

In [10]:
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [11]:
nasa["fall"].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [12]:
nasa.to_json('nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [13]:
import pandas as pd
import numpy as np

In [17]:
#Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [19]:
shuttle = pd.read_csv(tst_url,sep=' ', names=cols)
shuttle

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1
...,...,...,...,...,...,...,...,...,...
80,0,84,0,-36,-29,4,120,116,5
55,0,81,0,-20,25,26,102,76,4
55,0,77,0,12,-22,22,65,42,4
37,0,103,0,18,-16,66,85,20,1
56,2,98,0,52,1,42,46,4,4

Let's verify that this worked by looking at the `head()` function.

In [20]:
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [21]:
shuttle.to_csv("shuttle.csv", sep = ",")

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [22]:
astronaut = pd.read_excel("astronauts.xls")
astronaut

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,1956-08-23,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaT,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,1962-07-26,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaT,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaT,NaN
355,John W. Young,1962.0,2.0,Retired,1930-09-24,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaT,NaN
356,George D. Zamka,1998.0,17.0,Retired,1962-06-29,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaT,NaN

Use the `head()` function to inspect the dataframe.

In [23]:
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [24]:
astronaut["Undergraduate Major"].value_counts()

Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Astronomy                                 1
Marine Engineering & Nautical Science     1
Philosophy                                1
Bioscience                                1
Military Science                          1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [25]:
astronaut.to_csv("astronaut.csv", sep = " ", index=False)

In [26]:
pd.read_csv("astronaut.csv", sep = " ")

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,1956-08-23,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaN,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,1962-07-26,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaN,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,1930-09-24,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,1962-06-29,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [46]:
columns = ['Season', 'Age at time', 'Diseases', 'Accident/trauma', 'Surgical intervention', 'Fevers last year', 'Freq alcohol', 'Smoking habit', 'Numb(h)/day ene-16', 'Output diagnosis']
fertility = pd.read_csv("fertility_Diagnosis.txt", sep="\,", names=columns)

C:\Users\Ana\AppData\Local\Temp\ipykernel_15660\1541822520.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  fertility = pd.read_csv("fertility_Diagnosis.txt", sep="\,", names=columns)

In [47]:
fertility = pd.DataFrame(fertility)
fertility

,Season,Age at time,Diseases,Accident/trauma,Surgical intervention,Fevers last year,Freq alcohol,Smoking habit,Numb(h)/day ene-16,Output diagnosis
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O
...,...,...,...,...,...,...,...,...,...,...
95,-1.00,0.67,1,0,0,0,1.0,-1,0.50,N
96,-1.00,0.61,1,0,0,0,0.8,0,0.50,N
97,-1.00,0.67,1,1,1,0,1.0,-1,0.31,N
98,-1.00,0.64,1,0,1,0,1.0,0,0.19,N
99,-1.00,0.69,0,1,1,0,0.6,-1,0.19,N